import React from 'react';

const serverAction = () => {
	return (
		<section className='flex flex-col gap-4'>
			<span className='text-muted-foreground'>
				في Next.js، يمكن تنفيذ الإجراءات (Actions) إما على الخادم باستخدام توجيه "use server"، أو على العميل. يؤثر هذا الاختيار على أداء
				التطبيق، أمانه، وتجربة المستخدم.
			</span>
			<div className='flex flex-col'>
				<h4 className='font-bold text-3xl'>Action on server ['use serve']</h4>
				<ul>
					<li>الأداء المحسّن: يتم تنفيذ العمليات على الخادم، مما يقلل من الحمل على جهاز المستخدم ويحسّن سرعة التطبيق.</li>
					<li>الأمان: يحمي البيانات الحساسة ويمنع الوصول غير المصرح به، حيث لا يتم كشف الشيفرة المصدرية أو البيانات الحساسة للعميل.</li>
					<li>التكامل مع مكونات الخادم: يسهل التعامل مع قواعد البيانات والعمليات التي تتطلب بيئة خادم.</li>
				</ul>
			</div>

			<div className='flex flex-col'>
				<h4 className='font-bold text-3xl'>Action on client</h4>
				<ul>
					<li>التفاعلية الفورية: يتيح استجابة سريعة لتفاعلات المستخدم دون الحاجة إلى انتظار استجابة الخادم.</li>
					<li>تجربة مستخدم محسّنة: يمكن تحديث واجهة المستخدم بشكل ديناميكي وسلس.</li>
					<li>تقليل الحمل على الخادم: يقلل من عدد الطلبات المرسلة إلى الخادم، مما يحسّن الأداء في بعض الحالات.</li>
				</ul>
			</div>
			<div className='flex flex-col'>
				<h4 className='font-bold text-3xl'>الاختيار بين التنفيذ على الخادم أو العميل يعتمد على:</h4>
				<ul>
					<li>نوع العملية: إذا كانت العملية تتطلب الوصول إلى قاعدة بيانات أو تتضمن بيانات حساسة، يُفضل تنفيذها على الخادم.</li>
					<li>التفاعلية المطلوبة: للتفاعلات الفورية والبسيطة، يمكن تنفيذها على العميل لتحسين تجربة المستخدم.</li>
					<li>
						الأمان والأداء: يجب مراعاة الأمان والأداء عند اتخاذ القرار، حيث أن بعض العمليات قد تكون أكثر أمانًا وكفاءة عند تنفيذها على
						الخادم.
					</li>
				</ul>
			</div>
		</section>
	);
};

export default serverAction;
